# written for flow package RTLCompiler 
set sdc_version 1.7 

set_operating_conditions typical
set_load 2.0 [all_outputs]
## driver/slew constraints on inputs
set data_inputs [list input1_rsc_vld {input1_rsc_dat[*]} output1_rsc_rdy {w2_rsc_0_0_dat[*]} {w2_rsc_1_0_dat[*]} {w2_rsc_2_0_dat[*]} {w2_rsc_3_0_dat[*]} {w2_rsc_4_0_dat[*]} {w2_rsc_5_0_dat[*]} {w2_rsc_6_0_dat[*]} {w2_rsc_7_0_dat[*]} {w2_rsc_8_0_dat[*]} {w2_rsc_9_0_dat[*]} {w2_rsc_10_0_dat[*]} {w2_rsc_11_0_dat[*]} {w2_rsc_12_0_dat[*]} {w2_rsc_13_0_dat[*]} {w2_rsc_14_0_dat[*]} {w2_rsc_15_0_dat[*]} {w2_rsc_16_0_dat[*]} {w2_rsc_17_0_dat[*]} {w2_rsc_18_0_dat[*]} {w2_rsc_19_0_dat[*]} {w2_rsc_20_0_dat[*]} {w2_rsc_21_0_dat[*]} {w2_rsc_22_0_dat[*]} {w2_rsc_23_0_dat[*]} {w2_rsc_24_0_dat[*]} {w2_rsc_25_0_dat[*]} {w2_rsc_26_0_dat[*]} {w2_rsc_27_0_dat[*]} {w2_rsc_28_0_dat[*]} {w2_rsc_29_0_dat[*]} {w2_rsc_30_0_dat[*]} {w2_rsc_31_0_dat[*]} {w2_rsc_32_0_dat[*]} {w2_rsc_33_0_dat[*]} {w2_rsc_34_0_dat[*]} {w2_rsc_35_0_dat[*]} {w2_rsc_36_0_dat[*]} {w2_rsc_37_0_dat[*]} {w2_rsc_38_0_dat[*]} {w2_rsc_39_0_dat[*]} {w2_rsc_40_0_dat[*]} {w2_rsc_41_0_dat[*]} {w2_rsc_42_0_dat[*]} {w2_rsc_43_0_dat[*]} {w2_rsc_44_0_dat[*]} {w2_rsc_45_0_dat[*]} {w2_rsc_46_0_dat[*]} {w2_rsc_47_0_dat[*]} {w2_rsc_48_0_dat[*]} {w2_rsc_49_0_dat[*]} {w2_rsc_50_0_dat[*]} {w2_rsc_51_0_dat[*]} {w2_rsc_52_0_dat[*]} {w2_rsc_53_0_dat[*]} {w2_rsc_54_0_dat[*]} {w2_rsc_55_0_dat[*]} {w2_rsc_56_0_dat[*]} {w2_rsc_57_0_dat[*]} {w2_rsc_58_0_dat[*]} {w2_rsc_59_0_dat[*]} {w2_rsc_60_0_dat[*]} {w2_rsc_61_0_dat[*]} {w2_rsc_62_0_dat[*]} {w2_rsc_63_0_dat[*]} {b2_rsc_dat[*]} {w4_rsc_0_0_dat[*]} {w4_rsc_1_0_dat[*]} {w4_rsc_2_0_dat[*]} {w4_rsc_3_0_dat[*]} {w4_rsc_4_0_dat[*]} {w4_rsc_5_0_dat[*]} {w4_rsc_6_0_dat[*]} {w4_rsc_7_0_dat[*]} {w4_rsc_8_0_dat[*]} {w4_rsc_9_0_dat[*]} {w4_rsc_10_0_dat[*]} {w4_rsc_11_0_dat[*]} {w4_rsc_12_0_dat[*]} {w4_rsc_13_0_dat[*]} {w4_rsc_14_0_dat[*]} {w4_rsc_15_0_dat[*]} {w4_rsc_16_0_dat[*]} {w4_rsc_17_0_dat[*]} {w4_rsc_18_0_dat[*]} {w4_rsc_19_0_dat[*]} {w4_rsc_20_0_dat[*]} {w4_rsc_21_0_dat[*]} {w4_rsc_22_0_dat[*]} {w4_rsc_23_0_dat[*]} {w4_rsc_24_0_dat[*]} {w4_rsc_25_0_dat[*]} {w4_rsc_26_0_dat[*]} {w4_rsc_27_0_dat[*]} {w4_rsc_28_0_dat[*]} {w4_rsc_29_0_dat[*]} {w4_rsc_30_0_dat[*]} {w4_rsc_31_0_dat[*]} {w4_rsc_32_0_dat[*]} {w4_rsc_33_0_dat[*]} {w4_rsc_34_0_dat[*]} {w4_rsc_35_0_dat[*]} {w4_rsc_36_0_dat[*]} {w4_rsc_37_0_dat[*]} {w4_rsc_38_0_dat[*]} {w4_rsc_39_0_dat[*]} {w4_rsc_40_0_dat[*]} {w4_rsc_41_0_dat[*]} {w4_rsc_42_0_dat[*]} {w4_rsc_43_0_dat[*]} {w4_rsc_44_0_dat[*]} {w4_rsc_45_0_dat[*]} {w4_rsc_46_0_dat[*]} {w4_rsc_47_0_dat[*]} {w4_rsc_48_0_dat[*]} {w4_rsc_49_0_dat[*]} {w4_rsc_50_0_dat[*]} {w4_rsc_51_0_dat[*]} {w4_rsc_52_0_dat[*]} {w4_rsc_53_0_dat[*]} {w4_rsc_54_0_dat[*]} {w4_rsc_55_0_dat[*]} {w4_rsc_56_0_dat[*]} {w4_rsc_57_0_dat[*]} {w4_rsc_58_0_dat[*]} {w4_rsc_59_0_dat[*]} {w4_rsc_60_0_dat[*]} {w4_rsc_61_0_dat[*]} {w4_rsc_62_0_dat[*]} {w4_rsc_63_0_dat[*]} {b4_rsc_dat[*]} {w6_rsc_0_0_dat[*]} {w6_rsc_1_0_dat[*]} {w6_rsc_2_0_dat[*]} {w6_rsc_3_0_dat[*]} {w6_rsc_4_0_dat[*]} {w6_rsc_5_0_dat[*]} {w6_rsc_6_0_dat[*]} {w6_rsc_7_0_dat[*]} {w6_rsc_8_0_dat[*]} {w6_rsc_9_0_dat[*]} {b6_rsc_dat[*]}]
set_driving_cell -no_design_rule -library NangateOpenCellLibrary -lib_cell BUF_X2 -pin Z $data_inputs
create_clock -name clk -period 10.0 -waveform { 0.0 5.0 } [get_ports {clk}]
set_clock_uncertainty 0.0 [get_clocks {clk}]

create_clock -name virtual_io_clk -period 10.0
## IO TIMING CONSTRAINTS
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {rst}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {input1_rsc_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {input1_rsc_vld}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {input1_rsc_rdy}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {output1_rsc_dat[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {output1_rsc_vld}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {output1_rsc_rdy}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {const_size_in_1_rsc_dat[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {const_size_in_1_rsc_vld}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {const_size_out_1_rsc_dat[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {const_size_out_1_rsc_vld}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_0_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_1_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_2_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_3_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_4_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_5_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_6_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_7_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_8_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_9_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_10_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_11_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_12_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_13_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_14_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_15_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_16_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_17_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_18_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_19_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_20_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_21_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_22_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_23_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_24_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_25_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_26_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_27_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_28_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_29_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_30_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_31_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_32_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_33_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_34_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_35_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_36_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_37_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_38_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_39_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_40_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_41_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_42_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_43_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_44_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_45_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_46_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_47_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_48_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_49_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_50_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_51_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_52_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_53_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_54_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_55_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_56_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_57_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_58_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_59_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_60_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_61_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_62_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w2_rsc_63_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {b2_rsc_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_0_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_1_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_2_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_3_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_4_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_5_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_6_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_7_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_8_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_9_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_10_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_11_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_12_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_13_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_14_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_15_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_16_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_17_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_18_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_19_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_20_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_21_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_22_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_23_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_24_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_25_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_26_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_27_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_28_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_29_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_30_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_31_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_32_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_33_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_34_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_35_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_36_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_37_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_38_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_39_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_40_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_41_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_42_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_43_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_44_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_45_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_46_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_47_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_48_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_49_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_50_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_51_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_52_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_53_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_54_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_55_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_56_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_57_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_58_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_59_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_60_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_61_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_62_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w4_rsc_63_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {b4_rsc_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w6_rsc_0_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w6_rsc_1_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w6_rsc_2_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w6_rsc_3_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w6_rsc_4_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w6_rsc_5_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w6_rsc_6_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w6_rsc_7_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w6_rsc_8_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {w6_rsc_9_0_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {b6_rsc_dat[*]}]

