{"class_name": "Sequential", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "BinaryDense", "config": {"kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 1.0, "seed": null, "minval": -1.0}}, "name": "binary_dense_2", "kernel_constraint": {"class_name": "Clip", "config": {"max_value": 1.0, "min_value": -1.0}}, "bias_regularizer": null, "bias_constraint": null, "dtype": "float64", "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "H": 1.0, "units": 64, "batch_input_shape": [null, 16], "use_bias": false, "bias_lr_multiplier": null, "kernel_lr_multiplier": 7.302967548370361}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "dtype": "float64", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.0001, "gamma_constraint": null, "batch_input_shape": [null, 64], "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, {"class_name": "Activation", "config": {"activation": "binary_tanh", "trainable": true, "name": "activation_1"}}, {"class_name": "BinaryDense", "config": {"kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 1.0, "seed": null, "minval": -1.0}}, "name": "binary_dense_4", "kernel_constraint": {"class_name": "Clip", "config": {"max_value": 1.0, "min_value": -1.0}}, "bias_regularizer": null, "bias_constraint": null, "dtype": "float64", "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "H": 1.0, "units": 32, "batch_input_shape": [null, 64], "use_bias": false, "bias_lr_multiplier": null, "kernel_lr_multiplier": 8.0}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "dtype": "float64", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.0001, "gamma_constraint": null, "batch_input_shape": [null, 32], "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, {"class_name": "Activation", "config": {"activation": "binary_tanh", "trainable": true, "name": "activation_2"}}, {"class_name": "BinaryDense", "config": {"kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 1.0, "seed": null, "minval": -1.0}}, "name": "binary_dense_6", "kernel_constraint": {"class_name": "Clip", "config": {"max_value": 1.0, "min_value": -1.0}}, "bias_regularizer": null, "bias_constraint": null, "dtype": "float64", "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "H": 1.0, "units": 32, "batch_input_shape": [null, 32], "use_bias": false, "bias_lr_multiplier": null, "kernel_lr_multiplier": 6.531972885131836}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "dtype": "float64", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.0001, "gamma_constraint": null, "batch_input_shape": [null, 32], "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, {"class_name": "Activation", "config": {"activation": "binary_tanh", "trainable": true, "name": "activation_3"}}, {"class_name": "BinaryDense", "config": {"kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 1.0, "seed": null, "minval": -1.0}}, "name": "binary_dense_8", "kernel_constraint": {"class_name": "Clip", "config": {"max_value": 1.0, "min_value": -1.0}}, "bias_regularizer": null, "bias_constraint": null, "dtype": "float64", "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "H": 1.0, "units": 5, "batch_input_shape": [null, 32], "use_bias": false, "bias_lr_multiplier": null, "kernel_lr_multiplier": 4.966554641723633}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "dtype": "float64", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.0001, "gamma_constraint": null, "batch_input_shape": [null, 5], "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}], "name": "sequential_1"}, "backend": "tensorflow"}