# written for flow package RTLCompiler 
set sdc_version 1.7 

set_operating_conditions typical
set_load 2.0 [all_outputs]
## driver/slew constraints on inputs
set data_inputs [list input1_rsc_vld {input1_rsc_dat[*]} layer7_out_rsc_rdy const_size_in_1_rsc_rdy const_size_out_1_rsc_rdy {w2_rsc_qb[*]} {w2_rsc_qa[*]} {b2_rsc_dat[*]} {w4_rsc_qb[*]} {w4_rsc_qa[*]} {b4_rsc_dat[*]} {w6_rsc_qb[*]} {w6_rsc_qa[*]} {b6_rsc_dat[*]}]
set_driving_cell -no_design_rule -library NangateOpenCellLibrary -lib_cell BUF_X2 -pin Z $data_inputs
create_clock -name clk -period 10.0 -waveform { 0.0 5.0 } [get_ports {clk}]
set_clock_uncertainty 0.0 [get_clocks {clk}]

create_clock -name virtual_io_clk -period 10.0
## IO TIMING CONSTRAINTS
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {rst}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {input1_rsc_dat[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {input1_rsc_vld}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {input1_rsc_rdy}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {layer7_out_rsc_dat[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {layer7_out_rsc_vld}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {layer7_out_rsc_rdy}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {const_size_in_1_rsc_dat[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {const_size_in_1_rsc_vld}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {const_size_in_1_rsc_rdy}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {const_size_out_1_rsc_dat[*]}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {const_size_out_1_rsc_vld}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {const_size_out_1_rsc_rdy}]
set_max_delay 10.0 -from [all_inputs] -to [all_outputs]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w2_rsc_adra[*]}]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w2_rsc_da[*]}]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w2_rsc_ena}]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w2_rsc_wea}]
set_input_delay -clock [get_clocks {clk}] 0.5 [get_ports {w2_rsc_qa[*]}]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w2_rsc_adrb[*]}]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w2_rsc_db[*]}]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w2_rsc_enb}]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w2_rsc_web}]
set_input_delay -clock [get_clocks {clk}] 0.5 [get_ports {w2_rsc_qb[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {b2_rsc_dat[*]}]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w4_rsc_adra[*]}]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w4_rsc_da[*]}]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w4_rsc_ena}]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w4_rsc_wea}]
set_input_delay -clock [get_clocks {clk}] 0.5 [get_ports {w4_rsc_qa[*]}]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w4_rsc_adrb[*]}]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w4_rsc_db[*]}]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w4_rsc_enb}]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w4_rsc_web}]
set_input_delay -clock [get_clocks {clk}] 0.5 [get_ports {w4_rsc_qb[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {b4_rsc_dat[*]}]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w6_rsc_adra[*]}]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w6_rsc_da[*]}]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w6_rsc_ena}]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w6_rsc_wea}]
set_input_delay -clock [get_clocks {clk}] 0.5 [get_ports {w6_rsc_qa[*]}]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w6_rsc_adrb[*]}]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w6_rsc_db[*]}]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w6_rsc_enb}]
set_output_delay -clock [get_clocks {clk}] 0.01 [get_ports {w6_rsc_web}]
set_input_delay -clock [get_clocks {clk}] 0.5 [get_ports {w6_rsc_qb[*]}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {b6_rsc_dat[*]}]

