{
    "backend": "tensorflow", 
    "class_name": "Model", 
    "config": {
        "input_layers": [
            [
                "input_1", 
                0, 
                0
            ]
        ], 
        "layers": [
            {
                "class_name": "InputLayer", 
                "config": {
                    "batch_input_shape": [
                        null, 
                        1, 
                        27
                    ], 
                    "dtype": "float32", 
                    "name": "input_1", 
                    "sparse": false
                }, 
                "inbound_nodes": [], 
                "name": "input_1"
            }, 
            {
                "class_name": "Flatten", 
                "config": {
                    "name": "flatten_1", 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "input_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "flatten_1"
            }, 
            {
                "class_name": "Dense", 
                "config": {
                    "activation": "relu", 
                    "activity_regularizer": null, 
                    "bias_constraint": null, 
                    "bias_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "mode": "fan_in", 
                            "scale": 1.0, 
                            "seed": null
                        }
                    }, 
                    "bias_regularizer": null, 
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "mode": "fan_in", 
                            "scale": 1.0, 
                            "seed": null
                        }
                    }, 
                    "kernel_regularizer": null, 
                    "name": "fc1_relu", 
                    "trainable": true, 
                    "units": 64, 
                    "use_bias": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "flatten_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "fc1_relu"
            }, 
            {
                "class_name": "Dropout", 
                "config": {
                    "name": "fc1_dropout", 
                    "rate": 0.1, 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "fc1_relu", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "fc1_dropout"
            }, 
            {
                "class_name": "Dense", 
                "config": {
                    "activation": "relu", 
                    "activity_regularizer": null, 
                    "bias_constraint": null, 
                    "bias_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "mode": "fan_in", 
                            "scale": 1.0, 
                            "seed": null
                        }
                    }, 
                    "bias_regularizer": null, 
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "mode": "fan_in", 
                            "scale": 1.0, 
                            "seed": null
                        }
                    }, 
                    "kernel_regularizer": null, 
                    "name": "fc2_relu", 
                    "trainable": true, 
                    "units": 32, 
                    "use_bias": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "fc1_dropout", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "fc2_relu"
            }, 
            {
                "class_name": "Dropout", 
                "config": {
                    "name": "fc2_dropout", 
                    "rate": 0.1, 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "fc2_relu", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "fc2_dropout"
            }, 
            {
                "class_name": "Dense", 
                "config": {
                    "activation": "relu", 
                    "activity_regularizer": null, 
                    "bias_constraint": null, 
                    "bias_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "mode": "fan_in", 
                            "scale": 1.0, 
                            "seed": null
                        }
                    }, 
                    "bias_regularizer": null, 
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "mode": "fan_in", 
                            "scale": 1.0, 
                            "seed": null
                        }
                    }, 
                    "kernel_regularizer": null, 
                    "name": "fc3_relu", 
                    "trainable": true, 
                    "units": 32, 
                    "use_bias": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "fc2_dropout", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "fc3_relu"
            }, 
            {
                "class_name": "Dropout", 
                "config": {
                    "name": "fc3_dropout", 
                    "rate": 0.1, 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "fc3_relu", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "fc3_dropout"
            }, 
            {
                "class_name": "Dense", 
                "config": {
                    "activation": "softmax", 
                    "activity_regularizer": null, 
                    "bias_constraint": null, 
                    "bias_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "mode": "fan_in", 
                            "scale": 1.0, 
                            "seed": null
                        }
                    }, 
                    "bias_regularizer": null, 
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "mode": "fan_in", 
                            "scale": 1.0, 
                            "seed": null
                        }
                    }, 
                    "kernel_regularizer": null, 
                    "name": "softmax", 
                    "trainable": true, 
                    "units": 2, 
                    "use_bias": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "fc3_dropout", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "softmax"
            }
        ], 
        "name": "model_1", 
        "output_layers": [
            [
                "softmax", 
                0, 
                0
            ]
        ]
    }, 
    "keras_version": "2.0.0"
}
