{
  "class_name": "Sequential",
  "config": {
    "name": "sequential",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            224,
            224,
            3
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "q_conv2d_batchnorm_input"
        }
      },
      {
        "class_name": "QConv2DBatchnorm",
        "config": {
          "name": "q_conv2d_batchnorm",
          "trainable": true,
          "batch_input_shape": [
            null,
            224,
            224,
            3
          ],
          "dtype": "float32",
          "filters": 8,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            2,
            2
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "HeNormal",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": {
            "class_name": "Clip",
            "config": {
              "min_value": -1,
              "max_value": 1
            }
          },
          "bias_constraint": {
            "class_name": "Clip",
            "config": {
              "min_value": -1,
              "max_value": 1
            }
          },
          "kernel_quantizer": {
            "class_name": "quantized_bits",
            "config": {
              "bits": 8,
              "integer": 0,
              "symmetric": true,
              "alpha": "auto_po2",
              "keep_negative": true,
              "use_stochastic_rounding": false,
              "qnoise_factor": 1.0
            }
          },
          "bias_quantizer": {
            "class_name": "quantized_bits",
            "config": {
              "bits": 8,
              "integer": 0,
              "symmetric": 0,
              "alpha": null,
              "keep_negative": true,
              "use_stochastic_rounding": false,
              "qnoise_factor": 1.0
            }
          },
          "kernel_range": null,
          "bias_range": null,
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null,
          "ema_freeze_delay": null,
          "folding_mode": "ema_stats_folding"
        }
      }
    ]
  },
  "keras_version": "2.4.0",
  "backend": "tensorflow"
}