{"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 25], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}}, {"class_name": "ThresholdedReLU", "config": {"name": "thresholded_re_lu", "trainable": true, "dtype": "float32", "theta": 2.0}}]}, "keras_version": "2.13.1", "backend": "tensorflow"}