{
    "backend": "tensorflow",
    "class_name": "Sequential",
    "config": [
        {
            "class_name": "Dense",
            "config": {
                "activation": "relu",
                "activity_regularizer": null,
                "batch_input_shape": [
                    null,
                    784
                ],
                "bias_constraint": null,
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "bias_regularizer": null,
                "dtype": "float32",
                "kernel_constraint": null,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "distribution": "uniform",
                        "mode": "fan_avg",
                        "scale": 1.0,
                        "seed": null
                    }
                },
                "kernel_regularizer": {
                    "class_name": "L1L2",
                    "config": {
                        "l1": 4.999999873689376e-05,
                        "l2": 0.0
                    }
                },
                "name": "fc1_relu",
                "trainable": true,
                "units": 512,
                "use_bias": true
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_1",
                "noise_shape": null,
                "rate": 0.2,
                "seed": null,
                "trainable": true
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "activation": "relu",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "bias_regularizer": null,
                "kernel_constraint": null,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "distribution": "uniform",
                        "mode": "fan_avg",
                        "scale": 1.0,
                        "seed": null
                    }
                },
                "kernel_regularizer": {
                    "class_name": "L1L2",
                    "config": {
                        "l1": 4.999999873689376e-05,
                        "l2": 0.0
                    }
                },
                "name": "fc2_relu",
                "trainable": true,
                "units": 512,
                "use_bias": true
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_2",
                "noise_shape": null,
                "rate": 0.2,
                "seed": null,
                "trainable": true
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "activation": "softmax",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "bias_regularizer": null,
                "kernel_constraint": null,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "distribution": "uniform",
                        "mode": "fan_avg",
                        "scale": 1.0,
                        "seed": null
                    }
                },
                "kernel_regularizer": null,
                "name": "dense_1",
                "trainable": true,
                "units": 10,
                "use_bias": true
            }
        }
    ],
    "keras_version": "2.2.2"
}
